particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
/*
 * Copyright (c) 2018 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#include "logging.h"
LOG_SOURCE_CATEGORY("hal.ble_api")

/* Headers included from nRF5_SDK/components/softdevice/s140/headers */
#include "ble.h"
#include "ble_gap.h"
#include "ble_gatt.h"
#include "ble_gatts.h"
#include "ble_gattc.h"
#include "ble_types.h"
/* Headers included from nRF5_SDK/components/softdevice/common */
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"

#include "app_util.h"

#include "concurrent_hal.h"
#include "static_recursive_mutex.h"
#include <mutex>

#include "ble_hal_api.h"
#include "system_error.h"

#include <string.h>


#define BLE_CONN_CFG_TAG                        1
#define BLE_OBSERVER_PRIO                       1

#define BLE_ADV_DATA_ADVERTISING                0
#define BLE_ADV_DATA_SCAN_RESPONSE              1


StaticRecursiveMutex s_bleMutex;

class bleLock {
    static void lock() {
        s_bleMutex.lock();
    }

    static void unlock() {
        s_bleMutex.unlock();
    }
};

static ble_event_callback_t     s_bleEvtCallbacks[BLE_MAX_EVENT_CALLBACK_COUNT];

static ble_gap_addr_t           s_whitelist[BLE_MAX_WHITELIST_ADDR_COUNT];
static ble_gap_addr_t const*    s_whitelist_ptr[BLE_MAX_WHITELIST_ADDR_COUNT];

static uint8_t  s_advHandle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;

static uint8_t  s_advData[BLE_MAX_ADV_DATA_LEN] = {
    0x02,
    BLE_SIG_AD_TYPE_FLAGS,
    BLE_SIG_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE,
};
static uint16_t s_advDataLen = 3;

static uint8_t  s_scanRespData[BLE_MAX_ADV_DATA_LEN];
static uint16_t s_scanRespDataLen = 0;

static hal_ble_scan_params_t    s_scanParams = {
    .active        = true,
    .filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL,
    .interval      = BLE_DEFAULT_SCANNING_INTERVAL,
    .window        = BLE_DEFAULT_SCANNING_WINDOW,
    .timeout       = BLE_DEFAULT_SCANNING_TIMEOUT
};

static uint8_t                  s_scanReportBuff[BLE_MAX_SCAN_REPORT_BUF_LEN];

static ble_data_t               s_bleScanData = {
    s_scanReportBuff,
    BLE_MAX_SCAN_REPORT_BUF_LEN
};

static uint8_t s_connParamsUpdateAttempts = 0;

static hal_ble_status_t s_bleStatus = {
    .initialized   = 0,
    .advertising   = 0,
    .scanning      = 0,
    .connected     = 0,
    .ind_confirmed = 1,
};

static os_queue_t  s_bleEvtQueue = NULL;
static os_thread_t s_bleEvtThread = NULL;
static os_timer_t  s_connParamsUpdateTimer = NULL;

/*
 * Valid TX Power for nRF52840:
 * -40dBm, -20dBm, -16dBm, -12dBm, -8dBm, -4dBm, 0dBm, +2dBm, +3dBm, +4dBm, +5dBm, +6dBm, +7dBm and +8dBm.
 */
static const int8_t s_validTxPower[] = {
    -20, -16, -12, -8, -4, 0, 4, 8
};


static system_error_t sysError(uint32_t error) {
    switch (error) {
        case NRF_SUCCESS:                       return SYSTEM_ERROR_NONE;
        case NRF_ERROR_SVC_HANDLER_MISSING:
        case NRF_ERROR_NOT_SUPPORTED:           return SYSTEM_ERROR_NOT_SUPPORTED;
        case NRF_ERROR_SOFTDEVICE_NOT_ENABLED:
        case NRF_ERROR_INVALID_STATE:           return SYSTEM_ERROR_INVALID_STATE;
        case NRF_ERROR_INTERNAL:                return SYSTEM_ERROR_INTERNAL;
        case NRF_ERROR_NO_MEM:                  return SYSTEM_ERROR_NO_MEMORY;
        case NRF_ERROR_NOT_FOUND:               return SYSTEM_ERROR_NOT_FOUND;
        case NRF_ERROR_INVALID_PARAM:
        case NRF_ERROR_INVALID_LENGTH:
        case NRF_ERROR_INVALID_FLAGS:
        case NRF_ERROR_INVALID_DATA:
        case NRF_ERROR_DATA_SIZE:
        case NRF_ERROR_NULL:                    return SYSTEM_ERROR_INVALID_ARGUMENT;
        case NRF_ERROR_TIMEOUT:                 return SYSTEM_ERROR_TIMEOUT;
        case NRF_ERROR_FORBIDDEN:
        case NRF_ERROR_INVALID_ADDR:            return SYSTEM_ERROR_NOT_ALLOWED;
        case NRF_ERROR_BUSY:                    return SYSTEM_ERROR_BUSY;
        case NRF_ERROR_CONN_COUNT:              return SYSTEM_ERROR_LIMIT_EXCEEDED;
        case NRF_ERROR_RESOURCES:               return SYSTEM_ERROR_ABORTED;
        default:                                return SYSTEM_ERROR_UNKNOWN;
    }
}

static int8_t roundTxPower(int8_t value) {
    uint8_t i = 0;

    for (i = 0; i < sizeof(s_validTxPower); i++) {
        if (value == s_validTxPower[i]) {
            return value;
        }
        else {
            if (value < s_validTxPower[i]) {
                return s_validTxPower[i];
            }
        }
    }

    return s_validTxPower[i - 1];
}

static int locateAdStructure(uint8_t flag, uint8_t* data, uint16_t len, uint16_t* offset, uint16_t* adsLen) {
    if (flag == BLE_SIG_AD_TYPE_FLAGS) {
        *offset = 0;
        *adsLen = 3;
        return SYSTEM_ERROR_NONE;
    }

    // A valid AD structure is composed of Length field, Type field and Data field.
    // Each field should be filled with at least one byte.
    for (uint16_t i = 3; (i + 3) <= len; i = i) {
        *adsLen = data[i];

        uint8_t adsType = data[i + 1];
        if (adsType == flag) {
            // The value of adsLen doesn't include the length field of an AD structure.
            if ((i + *adsLen + 1) <= len) {
                *offset = i;
                *adsLen += 1;
                return SYSTEM_ERROR_NONE;
            }
            else {
                return SYSTEM_ERROR_INTERNAL;
            }
        }
        else {
            // Navigate to the next AD structure.
            i += (*adsLen + 1);
        }
    }

    return SYSTEM_ERROR_NOT_FOUND;
}

static int adStructEncode(uint8_t adType, uint8_t* data, uint16_t len, uint8_t flag) {
    uint8_t*  pAdvData = NULL;
    uint16_t* pAdvDataLen = NULL;
    uint16_t  offset;
    uint16_t  adsLen;
    bool      adsExist = false;

    if (flag == BLE_ADV_DATA_ADVERTISING) {
        pAdvData = s_advData;
        pAdvDataLen = &s_advDataLen;
    }
    else if (flag == BLE_ADV_DATA_SCAN_RESPONSE && adType != BLE_SIG_AD_TYPE_FLAGS) {
        // The scan response data should not contain the AD Flags AD structure.
        pAdvData = s_scanRespData;
        pAdvDataLen = &s_scanRespDataLen;
    }
    else {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (locateAdStructure(adType, pAdvData, *pAdvDataLen, &offset, &adsLen) == SYSTEM_ERROR_NONE) {
        adsExist = true;
    }

    if (data == NULL) {
        // The advertising data must contain the AD Flags AD structure.
        if (adType == BLE_SIG_AD_TYPE_FLAGS) {
            return SYSTEM_ERROR_NOT_SUPPORTED;
        }

