particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
        // Remove the AD structure from advertising data.
        if (adsExist == true) {
            uint16_t moveLen = *pAdvDataLen - offset - adsLen;
            memcpy(&pAdvData[offset], &pAdvData[offset + adsLen], moveLen);
            *pAdvDataLen = *pAdvDataLen - adsLen;
        }

        return SYSTEM_ERROR_NONE;
    }
    else if (adsExist) {
        // Update the existing AD structure.
        uint16_t staLen = *pAdvDataLen - adsLen;
        if ((staLen + len + 2) <= BLE_MAX_ADV_DATA_LEN) {
            // Firstly, move the last consistent block.
            uint16_t moveLen = *pAdvDataLen - offset - adsLen;
            memmove(&pAdvData[offset + len], &pAdvData[offset + adsLen], moveLen);

            // Secondly, Update the AD structure.
            // The Length field is the total length of Type field and Data field.
            pAdvData[offset + 1] = len + 1;
            memcpy(&pAdvData[offset + 2], data, len);

            // An AD structure is composed of one byte length field, one byte Type field and Data field.
            *pAdvDataLen = staLen + len + 2;
            return SYSTEM_ERROR_NONE;
        }
        else {
            return SYSTEM_ERROR_LIMIT_EXCEEDED;
        }
    }
    else {
        // Append the AD structure at the and of advertising data.
        if ((*pAdvDataLen + len + 2) <= BLE_MAX_ADV_DATA_LEN) {
            pAdvData[(*pAdvDataLen)++] = len + 1;
            pAdvData[(*pAdvDataLen)++] = adType;
            memcpy(&pAdvData[*pAdvDataLen], data, len);
            *pAdvDataLen += len;
            return SYSTEM_ERROR_NONE;
        }
        else {
            return SYSTEM_ERROR_LIMIT_EXCEEDED;
        }
    }
}

int setAdvData(uint8_t* data, uint16_t len, uint8_t flag) {
    if ((data == NULL) || (len < 3 && flag == BLE_ADV_DATA_ADVERTISING)) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    bool advPending = false;

    // It is invalid to provide the same data buffers while advertising.
    if (s_bleStatus.advertising) {
        int err = ble_stop_advertising();
        if (err != SYSTEM_ERROR_NONE) {
            return err;
        }
        advPending = true;
    }

    // Make sure the scan response data is consistent.
    ble_gap_adv_data_t bleGapAdvData;
    if (flag == BLE_ADV_DATA_ADVERTISING) {
        bleGapAdvData.adv_data.p_data      = data;
        bleGapAdvData.adv_data.len         = len;
        bleGapAdvData.scan_rsp_data.p_data = s_scanRespData;
        bleGapAdvData.scan_rsp_data.len    = s_scanRespDataLen;
    }
    else {
        bleGapAdvData.adv_data.p_data      = s_advData;
        bleGapAdvData.adv_data.len         = s_advDataLen;
        bleGapAdvData.scan_rsp_data.p_data = data;
        bleGapAdvData.scan_rsp_data.len    = len;
    }

    ret_code_t ret = sd_ble_gap_adv_set_configure(&s_advHandle, &bleGapAdvData, NULL);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_adv_set_configure() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    if (flag == BLE_ADV_DATA_ADVERTISING) {
        memcpy(s_advData, data, len);
        s_advDataLen = len;
    }
    else {
        memcpy(s_scanRespData, data, len);
        s_scanRespDataLen = len;
    }

    if (advPending) {
        advPending = false;
        return ble_start_advertising();
    }

    return SYSTEM_ERROR_NONE;
}

static bool isConnParamsFeeded(hal_ble_conn_params_t* conn_params) {
    hal_ble_conn_params_t ppcp;

    if (ble_get_ppcp(&ppcp) == SYSTEM_ERROR_NONE) {
        uint16_t minAcceptedSl = ppcp.slave_latency - MIN(BLE_CONN_PARAMS_SLAVE_LATENCY_ERR, ppcp.slave_latency);
        uint16_t maxAcceptedSl = ppcp.slave_latency + BLE_CONN_PARAMS_SLAVE_LATENCY_ERR;
        uint16_t minAcceptedTo = ppcp.conn_sup_timeout - MIN(BLE_CONN_PARAMS_TIMEOUT_ERR, ppcp.conn_sup_timeout);
        uint16_t maxAcceptedTo = ppcp.conn_sup_timeout + BLE_CONN_PARAMS_TIMEOUT_ERR;

        if (conn_params->max_conn_interval < ppcp.min_conn_interval ||
                conn_params->max_conn_interval > ppcp.max_conn_interval) {
            return false;
        }
        if (conn_params->slave_latency < minAcceptedSl ||
                conn_params->slave_latency > maxAcceptedSl) {
            return false;
        }
        if (conn_params->conn_sup_timeout < minAcceptedTo ||
                conn_params->conn_sup_timeout > maxAcceptedTo) {
            return false;
        }
    }

    return true;
}

static void connParamsUpdateTimerCb(os_timer_t timer) {
    if (s_bleStatus.conn_handle == BLE_INVALID_CONN_HANDLE) {
        return;
    }

    hal_ble_conn_params_t ppcp;
    if (ble_get_ppcp(&ppcp) == SYSTEM_ERROR_NONE) {
        ble_gap_conn_params_t connParams;
        connParams.min_conn_interval = ppcp.min_conn_interval;
        connParams.max_conn_interval = ppcp.max_conn_interval;
        connParams.slave_latency     = ppcp.slave_latency;
        connParams.conn_sup_timeout  = ppcp.conn_sup_timeout;

        ret_code_t ret = sd_ble_gap_conn_param_update(s_bleStatus.conn_handle, &connParams);
        if (ret != NRF_SUCCESS) {
            LOG(WARN, "sd_ble_gap_conn_param_update() failed: %u", (unsigned)ret);
            return;
        }

        s_connParamsUpdateAttempts++;
    }
}

static void updateConnParamsIfNeeded(void) {
    if (s_bleStatus.role == BLE_ROLE_PERIPHERAL && !isConnParamsFeeded(&s_bleStatus.conn_params)) {
        if (s_connParamsUpdateAttempts < BLE_CONN_PARAMS_UPDATE_ATTEMPS) {
            if (s_connParamsUpdateTimer != NULL) {
                if (os_timer_change(s_connParamsUpdateTimer, OS_TIMER_CHANGE_START, true, 0, 0, NULL)) {
                    LOG(ERROR, "os_timer_change() failed.");
                    return;
                }
            }
            LOG_DEBUG(TRACE, "Attempts to update BLE connection parameters, try: %d after %d ms",
                    s_connParamsUpdateAttempts, BLE_CONN_PARAMS_UPDATE_DELAY_MS);
        }
        else {
            ret_code_t ret = sd_ble_gap_disconnect(s_bleStatus.conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
                return;
            }
            LOG_DEBUG(TRACE, "Disconnecting. Update BLE connection parameters failed.");
        }
    }
}

static int addService(uint8_t type, const ble_uuid_t* uuid, uint16_t* handle) {
    ret_code_t ret;
    ret = sd_ble_gatts_service_add(type, uuid, handle);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_service_add() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    LOG_DEBUG(TRACE, "Service handle: %d.", *handle);

    return SYSTEM_ERROR_NONE;
}

static int addCharacteristic(uint16_t service_handle, const ble_uuid_t* uuid, uint8_t properties, const char* desc, hal_ble_char_t* ble_char) {
    ret_code_t               ret;
    ble_gatts_char_md_t      char_md;
    ble_gatts_attr_md_t      value_attr_md;
    ble_gatts_attr_md_t      user_desc_attr_md;
    ble_gatts_attr_md_t      cccd_attr_md;
    ble_gatts_attr_t         char_value_attr;
    ble_gatts_char_handles_t char_handles;

