particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
    if (advPending) {
        advPending = false;
        return ble_start_advertising();
    }

    return sysError(ret);
}

int ble_set_adv_data_snippet(uint8_t adType, uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    LOG_DEBUG(TRACE, "ble_set_adv_data_snippet().");

    return adStructEncode(adType, data, len, BLE_ADV_DATA_ADVERTISING);
}

int ble_refresh_adv_data(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    LOG_DEBUG(TRACE, "ble_refresh_adv_data().");

    return setAdvData(s_advData, s_advDataLen, BLE_ADV_DATA_ADVERTISING);
}

int ble_set_adv_data(uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    LOG_DEBUG(TRACE, "ble_set_adv_data().");

    return setAdvData(data, len, BLE_ADV_DATA_ADVERTISING);
}

int ble_set_scan_resp_data_snippet(uint8_t adType, uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    LOG_DEBUG(TRACE, "ble_set_scan_resp_data_snippet().");

    return adStructEncode(adType, data, len, BLE_ADV_DATA_SCAN_RESPONSE);
}

int ble_refresh_scan_resp_data(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    LOG_DEBUG(TRACE, "ble_refresh_scan_resp_data().");

    return setAdvData(s_scanRespData, s_scanRespDataLen, BLE_ADV_DATA_SCAN_RESPONSE);
}

int ble_set_scan_resp_data(uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    LOG_DEBUG(TRACE, "ble_set_scan_resp_data().");

    return setAdvData(data, len, BLE_ADV_DATA_SCAN_RESPONSE);
}

int ble_start_advertising(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    LOG_DEBUG(TRACE, "ble_start_advertising().");

    if (s_bleStatus.advertising) {
        return SYSTEM_ERROR_NONE;
    }

    ret_code_t ret = sd_ble_gap_adv_start(s_advHandle, BLE_CONN_CFG_TAG);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_adv_start() failed: %u", (unsigned)ret);
        return sysError(ret);
    }
    else {
        s_bleStatus.advertising = true;
        return SYSTEM_ERROR_NONE;
    }
}

int ble_stop_advertising(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    LOG_DEBUG(TRACE, "ble_stop_advertising().");

    if (!s_bleStatus.advertising) {
        return SYSTEM_ERROR_NONE;
    }

    ret_code_t ret = sd_ble_gap_adv_stop(s_advHandle);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_adv_stop() failed: %u", (unsigned)ret);
        return sysError(ret);
    }
    else {
        s_bleStatus.advertising = false;
        return SYSTEM_ERROR_NONE;
    }
}

bool ble_is_advertising(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    return s_bleStatus.advertising;
}

int ble_set_scanning_params(hal_ble_scan_params_t* scan_params) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    LOG_DEBUG(TRACE, "ble_set_scanning_params().");

    if (scan_params->interval < BLE_GAP_SCAN_INTERVAL_MIN) {
        scan_params->interval = BLE_GAP_SCAN_INTERVAL_MIN;
    }
    if (scan_params->interval > BLE_GAP_SCAN_INTERVAL_MAX) {
        scan_params->interval = BLE_GAP_SCAN_INTERVAL_MAX;
    }
    if (scan_params->window < BLE_GAP_SCAN_WINDOW_MIN) {
        scan_params->window = BLE_GAP_SCAN_WINDOW_MIN;
    }
    if (scan_params->window > BLE_GAP_SCAN_WINDOW_MAX) {
        scan_params->window = BLE_GAP_SCAN_WINDOW_MAX;
    }

    memcpy(&s_scanParams, scan_params, sizeof(hal_ble_scan_params_t));

    return SYSTEM_ERROR_NONE;
}

int ble_start_scanning(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    LOG_DEBUG(TRACE, "ble_start_scanning().");

    ble_gap_scan_params_t bleGapScanParams;
    bleGapScanParams.active        = s_scanParams.active;
    bleGapScanParams.interval      = s_scanParams.interval;
    bleGapScanParams.window        = s_scanParams.window;
    bleGapScanParams.timeout       = s_scanParams.timeout;
    bleGapScanParams.scan_phys     = BLE_GAP_PHY_1MBPS;
    bleGapScanParams.filter_policy = s_scanParams.filter_policy;

    LOG_DEBUG(TRACE, "BLE scan interval: (%d x 0.625) ms.", bleGapScanParams.interval);
    LOG_DEBUG(TRACE, "BLE scan window:   (%d x 0.625) ms.", bleGapScanParams.window);
    LOG_DEBUG(TRACE, "BLE scan timeout:  (%d x 10) ms.", bleGapScanParams.timeout);

    ret_code_t ret = sd_ble_gap_scan_start(&bleGapScanParams, &s_bleScanData);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_scan_start() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return SYSTEM_ERROR_NONE;
}

int ble_stop_scanning(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    LOG_DEBUG(TRACE, "ble_stop_scanning().");

    ret_code_t ret = sd_ble_gap_scan_stop();
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_scan_start() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return SYSTEM_ERROR_NONE;
}

int ble_connect(hal_ble_address_t* addr) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    return 0;
}

bool ble_connected(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    return (s_bleStatus.conn_handle != BLE_INVALID_CONN_HANDLE) ? true : false;
}

int ble_status(hal_ble_status_t* status) {
    std::lock_guard<bleLock> lk(bleLock());

    memcpy(status, &s_bleStatus, sizeof(hal_ble_status_t));

    return SYSTEM_ERROR_NONE;
}

int ble_connect_cancel(void) {
    std::lock_guard<bleLock> lk(bleLock());

    LOG_DEBUG(TRACE, "ble_connect_cancel().");

    return 0;
}

int ble_set_ppcp(hal_ble_conn_params_t* conn_params) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    LOG_DEBUG(TRACE, "ble_set_ppcp().");

